Laravel-8-Blog/routes/web.php

SELECT * FROM `posts`
---

Route::get('/', [PostController::class, 'index'])->name('home');

Route::get('posts/{post:slug}', [PostController::class, 'show']);