Laravel-8-Blog/app/View/Components/CategoryDropdown.php

    public function render()
    {
        return view('components.category-dropdown', [
            'categories' =>Category::all(),
            'currentCategory' => Category::firstWhere('slug', request('category'))
        ]);
---
SELECT * FROM `categories`
SELECT * FROM `categories` WHERE `slug` = 'est-nisi-eligendi-quidem-rerum-consectetur-officiis' LIMIT 1