Laravel-8-Blog/app/Http/Controllers/AdminPostController.php

    public function index()
    {
        return view('admin.posts.index', [
            'posts' => Post::paginate(50)
        ]);
---
SELECT * FROM `posts` LIMIT 50 offset 0
SELECT count(*) as aggregate FROM `posts`

    public function update(Post $post)
    {
        $attributes = $this->validatePost($post);

        if ($attributes['thumbnail'] ?? false) {
            $attributes['thumbnail'] = request()->file('thumbnail')->store('thumbnails');
        }

        $post->update($attributes);
---
UPDATE `posts` SET `category_id` = '2', `title` = 'Lozić je bio ovdje jednom asasas', `posts`.`updated_at` = '2022-03-20 19:06:22' WHERE `id` = 7