Laravel-8-Blog/app/Http/Controllers/RegisterController.php

    public function store()
    {
        $attributes = request()->validate([
            'name' => 'required|max:255',
            'username' => 'required|min:3|max:255|unique:users,username',
            'email' => 'required|email|max:255|unique:users,email',
            'password' => 'required|min:7|max:255'
        ]);

        $user = User::create($attributes);
---
INSERT INTO `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) VALUES ('Lorem Ipsum', 'Lorem-Ipsum', 'loremipsum@gmail.com', '$2y$10$fbg0IAx7UoULDEktGidfQuqq2x/sdaN1rV59sX5lWqXKD.cg.nUZC', '2022-03-21 21:07:40', '2022-03-21 21:07:40')